# HomeWork 1- 17350796

It includes Date of Sale, Price and Address of all residential properties purchased in Ireland since the 1st January 2010, 
as declared to the Revenue Commissioners for stamp duty purposes
csv file = ppr-17350796.csv

Question 1: Preparing the data from CSV

In [124]:
import pandas as pd

import numpy as np

import matplotlib.pyplot as plt

%matplotlib inline

from matplotlib.backends.backend_pdf import PdfPages

Reading in the data and displaying the first 5 rows:

In [125]:
df = pd.read_csv('ppr-17350796.csv', keep_default_na=True, sep=',\s+', delimiter=',', skipinitialspace=True)
# Show data frame first few rows
df.head(5)

,Date of Sale (dd/mm/yyyy),Address,Postal Code,County,Price (€),Not Full Market Price,VAT Exclusive,Description of Property,Property Size Description
0,06/05/2016,"21 CURZON ST, PORTOBELLO, DUBLIN 8",Dublin 8,Dublin,"€630,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN
1,22/12/2014,"44 ROTHE ABBEY, KILMAINHAM, DUBLIN 8",Dublin 8,Dublin,"€281,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN
2,22/05/2020,"17 MERRION PARK, BLACKROCK, DUBLIN",NaN,Dublin,"€560,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN
3,27/11/2014,"KNOCKROE, RATHMOYLE, CO.KILKENNY",NaN,Kilkenny,"€46,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN
4,22/11/2018,"15 SHANNON PARK, LIFFORD RD, ENNIS",NaN,Clare,"€204,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN

Displaying the last 5 rows

In [126]:
df.tail(5)

,Date of Sale (dd/mm/yyyy),Address,Postal Code,County,Price (€),Not Full Market Price,VAT Exclusive,Description of Property,Property Size Description
9995,15/12/2017,"KNOCKASARTNETT, KILLARNEY, KERRY",NaN,Kerry,"€200,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN
9996,18/12/2012,"17 the court, cypress downs, templeogue",NaN,Dublin,"€605,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN
9997,14/12/2016,"THE LOG CABIN, FORGE COTTAGE, CULLENSTOWN",NaN,Wexford,"€46,666.67",No,No,Second-Hand Dwelling house /Apartment,NaN
9998,19/06/2017,"CARRIG RD, PARKMORE, ROSCREA",NaN,Tipperary,"€176,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN
9999,02/11/2017,"26 KILSHANE RD, FINGLAS, DUBLIN 11",Dublin 11,Dublin,"€86,738.06",Yes,No,Second-Hand Dwelling house /Apartment,NaN

Display number of rows and columns- 10000 = Rows, 9 = columns

In [127]:
# number of rows and columns
df.shape

(10000, 9)

The data is currently all read as object. The data need to be change to the appropriate data type

In [128]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Date of Sale (dd/mm/yyyy)  10000 non-null  object
 1   Address                    10000 non-null  object
 2   Postal Code                1860 non-null   object
 3   County                     10000 non-null  object
 4   Price (€)                  10000 non-null  object
 5   Not Full Market Price      10000 non-null  object
 6   VAT Exclusive              10000 non-null  object
 7   Description of Property    10000 non-null  object
 8   Property Size Description  1029 non-null   object
dtypes: object(9)
memory usage: 703.2+ KB

Looking at the column names for errrors

In [129]:
df.columns

Index(['Date of Sale (dd/mm/yyyy)', 'Address', 'Postal Code', 'County',
       'Price (€)', 'Not Full Market Price', 'VAT Exclusive',
       'Description of Property', 'Property Size Description'],
      dtype='object')

In [130]:
# Converting price to float, you need to remove all symbols from strings for the command to work. 



df['Price (€)'] = df['Price (€)'].str.replace(',', '')


df['Price (€)'] = df['Price (€)'].str.replace('€', '')

df['Price (€)'] = df['Price (€)'].astype(float)

df[['Price (€)']]

      Price (€)
0     630000.00
1     281000.00
2     560000.00
3      46000.00
4     204000.00
...         ...
9995  200000.00
9996  605000.00
9997   46666.67
9998  176000.00
9999   86738.06

[10000 rows x 1 columns]

In [131]:


df['County'] = df['County'].astype('category')
df['Description of Property'] = df['Description of Property'].astype('category')
df['Postal Code'] = df['Postal Code'].astype('category')
df['Property Size Description'] = df['Property Size Description'].astype('category')
df['VAT Exclusive'] = df['VAT Exclusive'].astype('category')
df['Not Full Market Price'] = df['Not Full Market Price'].astype('category')






df.dtypes

Date of Sale (dd/mm/yyyy)      object
Address                        object
Postal Code                  category
County                       category
Price (€)                     float64
Not Full Market Price        category
VAT Exclusive                category
Description of Property      category
Property Size Description    category
dtype: object

In [132]:
# converting dates to date data type
df['Date of Sale (dd/mm/yyyy)'] = pd.to_datetime(df['Date of Sale (dd/mm/yyyy)'])

df.dtypes

Date of Sale (dd/mm/yyyy)    datetime64[ns]
Address                              object
Postal Code                        category
County                             category
Price (€)                           float64
Not Full Market Price              category
VAT Exclusive                      category
Description of Property            category
Property Size Description          category
dtype: object

Looking for duplicate rows and columns

In [133]:
# There is 20 non unique addresses 
df.nunique()

Date of Sale (dd/mm/yyyy)    2759
Address                      9980
Postal Code                    22
County                         26
Price (€)                    2285
Not Full Market Price           2
VAT Exclusive                   2
Description of Property         3
Property Size Description       4
dtype: int64

In [134]:
df.isnull().sum()

Date of Sale (dd/mm/yyyy)       0
Address                         0
Postal Code                  8140
County                          0
Price (€)                       0
Not Full Market Price           0
VAT Exclusive                   0
Description of Property         0
Property Size Description    8971
dtype: int64

In [135]:
df['Not Full Market Price'].value_counts(dropna=False)

No     9552
Yes     448
Name: Not Full Market Price, dtype: int64

There is some logical integrity issues with the data. Some post codes do not match the post codes in their addresses.

In [136]:
category_columns = df.select_dtypes(['category']).columns
df[category_columns].head()

,Postal Code,County,Not Full Market Price,VAT Exclusive,Description of Property,Property Size Description
0,Dublin 8,Dublin,No,No,Second-Hand Dwelling house /Apartment,NaN
1,Dublin 8,Dublin,No,No,Second-Hand Dwelling house /Apartment,NaN
2,NaN,Dublin,No,No,Second-Hand Dwelling house /Apartment,NaN
3,NaN,Kilkenny,No,No,Second-Hand Dwelling house /Apartment,NaN
4,NaN,Clare,No,No,Second-Hand Dwelling house /Apartment,NaN

In [137]:
df[category_columns].describe().T

,count,unique,top,freq
Postal Code,1860,22,Dublin 15,232
County,10000,26,Dublin,3193
Not Full Market Price,10000,2,No,9552
VAT Exclusive,10000,2,No,8399
Description of Property,10000,3,Second-Hand Dwelling house /Apartment,8363
Property Size Description,1029,4,greater than or equal to 38 sq metres and less...,723

In [139]:
numeric_columns = df.select_dtypes(['float64']).columns
numeric_columns

Index(['Price (€)'], dtype='object')

In [141]:
df['Price (€)'].describe()

count    1.000000e+04
mean     2.602607e+05
std      3.901703e+05
min      5.500000e+03
25%      1.200000e+05
50%      2.000000e+05
75%      3.083701e+05
max      1.715125e+07
Name: Price (€), dtype: float64

In [142]:
df['Address'].describe()

count                                     10000
unique                                     9980
top       13 CATHEDRAL WALK, BLACKPOOL, CO CORK
freq                                          2
Name: Address, dtype: object